spec/fixtures/vcr_cassettes/transaction_request_specs/when_paypal_is_the_payment_engine/should_redirect_to_paypal_when_a_new_transaction_is_started.yml

---
http_interactions:
- request:
    method: post
    uri: https://api-3t.sandbox.paypal.com/2.0/
    body:
      encoding: UTF-8
      string: |-
        <?xml version="1.0" encoding="UTF-8"?><env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><env:Header><RequesterCredentials xmlns="urn:ebay:api:PayPalAPI" xmlns:n1="urn:ebay:apis:eBLBaseComponents" env:mustUnderstand="0"><n1:Credentials><n1:Username>gary.taylor_api1.flexcommerce.com</n1:Username><n1:Password>CXLBLQM64B6AXULK</n1:Password><n1:Subject/><n1:Signature>ALYGfT1J93GLRZF-3Y94ce-Z4UZgAsHIQqBoD5p.DabVWhLPVXkcHJw0</n1:Signature></n1:Credentials></RequesterCredentials></env:Header><env:Body><SetExpressCheckoutReq xmlns="urn:ebay:api:PayPalAPI">
          <SetExpressCheckoutRequest xmlns:n2="urn:ebay:apis:eBLBaseComponents">
            <n2:Version>124</n2:Version>
            <n2:SetExpressCheckoutRequestDetails>
              <n2:ReturnURL>http://mydomain.com/good_url</n2:ReturnURL>
              <n2:CancelURL>http://mydomain.com/bad_url</n2:CancelURL>
              <n2:ReqBillingAddress>0</n2:ReqBillingAddress>
              <n2:NoShipping>0</n2:NoShipping>
              <n2:AddressOverride>0</n2:AddressOverride>
              <n2:PaymentDetails>
                <n2:OrderTotal currencyID="USD">10.00</n2:OrderTotal>
                <n2:ButtonSource>ActiveMerchant</n2:ButtonSource>
                <n2:PaymentAction>Sale</n2:PaymentAction>
              </n2:PaymentDetails>
            </n2:SetExpressCheckoutRequestDetails>
          </SetExpressCheckoutRequest>
        </SetExpressCheckoutReq>
        </env:Body></env:Envelope>
    headers:
      Content-Type:
      - application/x-www-form-urlencoded
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Mon, 09 Nov 2015 15:36:23 GMT
      Server:
      - Apache
      X-Paypal-Operation-Name:
      - SetExpressCheckout
      X-Paypal-Api-Rc:
      - ''
      Connection:
      - close
      Content-Length:
      - '1791'
      Paypal-Debug-Id:
      - 64a57026bfe4d
      Set-Cookie:
      - X-PP-SILOVER=; Expires=Thu, 01 Jan 1970 00:00:01 GMT
      - X-PP-SILOVER=name%3DSANDBOX3.API.1%26silo_version%3D880%26app%3Dappdispatcher_apit%26TIME%3D2008891478;
        domain=.paypal.com; path=/; Secure; HttpOnly
      Content-Type:
      - text/xml; charset=utf-8
    body:
      encoding: UTF-8
      string: <?xml version="1.0" encoding="UTF-8"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
        xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xs="http://www.w3.org/2001/XMLSchema"
        xmlns:cc="urn:ebay:apis:CoreComponentTypes" xmlns:wsu="http://schemas.xmlsoap.org/ws/2002/07/utility"
        xmlns:saml="urn:oasis:names:tc:SAML:1.0:assertion" xmlns:ds="http://www.w3.org/2000/09/xmldsig#"
        xmlns:wsse="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:ed="urn:ebay:apis:EnhancedDataTypes"
        xmlns:ebl="urn:ebay:apis:eBLBaseComponents" xmlns:ns="urn:ebay:api:PayPalAPI"><SOAP-ENV:Header><Security
        xmlns="http://schemas.xmlsoap.org/ws/2002/12/secext" xsi:type="wsse:SecurityType"></Security><RequesterCredentials
        xmlns="urn:ebay:api:PayPalAPI" xsi:type="ebl:CustomSecurityHeaderType"><Credentials
        xmlns="urn:ebay:apis:eBLBaseComponents" xsi:type="ebl:UserIdPasswordType"><Username
        xsi:type="xs:string"></Username><Password xsi:type="xs:string"></Password><Signature
        xsi:type="xs:string"></Signature><Subject xsi:type="xs:string"></Subject></Credentials></RequesterCredentials></SOAP-ENV:Header><SOAP-ENV:Body
        id="_0"><SetExpressCheckoutResponse xmlns="urn:ebay:api:PayPalAPI"><Timestamp
        xmlns="urn:ebay:apis:eBLBaseComponents">2015-11-09T15:36:24Z</Timestamp><Ack
        xmlns="urn:ebay:apis:eBLBaseComponents">Success</Ack><CorrelationID xmlns="urn:ebay:apis:eBLBaseComponents">64a57026bfe4d</CorrelationID><Version
        xmlns="urn:ebay:apis:eBLBaseComponents">124</Version><Build xmlns="urn:ebay:apis:eBLBaseComponents">18308778</Build><Token
        xsi:type="ebl:ExpressCheckoutTokenType">EC-73E34549M2129751H</Token></SetExpressCheckoutResponse></SOAP-ENV:Body></SOAP-ENV:Envelope>
    http_version: 
  recorded_at: Mon, 09 Nov 2015 15:36:24 GMT
recorded_with: VCR 3.0.0
